; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-79)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 - object)
 (:init 
    (arm-empty)
    (clear b21)
    (on b21 b10)
    (on b10 b20)
    (on b20 b3)
    (on b3 b15)
    (on b15 b14)
    (on b14 b11)
    (on b11 b5)
    (on b5 b12)
    (on b12 b7)
    (on b7 b6)
    (on b6 b8)
    (on b8 b4)
    (on b4 b19)
    (on b19 b13)
    (on-table b13)
    (clear b9)
    (on b9 b2)
    (on b2 b22)
    (on b22 b17)
    (on b17 b18)
    (on b18 b1)
    (on b1 b16)
    (on b16 b23)
    (on-table b23))
 (:goal (and 
(on b16 b9)
))
)

; plan
1. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 0 of 1
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
3. (unstack b2 b22)
   deleted: (on b2 b22) (clear b2) (arm-empty)
   added: (holding b2) (clear b22)
   goals met: 0 of 1
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
5. (unstack b22 b17)
   deleted: (on b22 b17) (clear b22) (arm-empty)
   added: (holding b22) (clear b17)
   goals met: 0 of 1
6. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 1
7. (unstack b17 b18)
   deleted: (on b17 b18) (clear b17) (arm-empty)
   added: (holding b17) (clear b18)
   goals met: 0 of 1
8. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
9. (unstack b18 b1)
   deleted: (on b18 b1) (clear b18) (arm-empty)
   added: (holding b18) (clear b1)
   goals met: 0 of 1
10. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
11. (unstack b1 b16)
   deleted: (on b1 b16) (clear b1) (arm-empty)
   added: (holding b1) (clear b16)
   goals met: 0 of 1
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
13. (unstack b16 b23)
   deleted: (on b16 b23) (clear b16) (arm-empty)
   added: (holding b16) (clear b23)
   goals met: 0 of 1
14. (stack b16 b9)
   deleted: (clear b9) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b9)
   goals met: 1 of 1
